Revit 2027 API
ExternalApplicationArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ExternalApplicationArrayIterator ReverseIterator()
Public Overridable Function ReverseIterator As ExternalApplicationArrayIterator
public:
virtual ExternalApplicationArrayIterator^ ReverseIterator()
abstract ReverseIterator : unit -> ExternalApplicationArrayIterator
override ReverseIterator : unit -> ExternalApplicationArrayIterator
Return Value
ExternalApplicationArrayIterator
Returns a backward moving iterator to the array.
See Also
Reference
ExternalApplicationArray Class
Autodesk.Revit.UI Namespace